using System.Collections.Generic;
using System.Web.Mvc;
using ASPMVC1.Models;
using Newtonsoft.Json;

namespace ASPMVC1.Controllers
{
    public class HomeController : Controller
    {
        public ActionResult Index()
        {
            var products = GetProducts();
            ApplyStylesToProductDescriptions(products);
            return View(products);
        }

        private List<ProductModel> GetProducts()
        {
            string productsDataPath = @"C:\Users\elont\OneDrive\Рабочий стол\LB-main\aspmvc original\ASPMVC1\ASPMVC1\bin\ProductList\products.json";

            if (System.IO.File.Exists(productsDataPath))
            {
                string json = System.IO.File.ReadAllText(productsDataPath);

                List<ProductModel> products = JsonConvert.DeserializeObject<List<ProductModel>>(json);

                return products;
            }

            return new List<ProductModel>();
        }

        private void ApplyStylesToProductDescriptions(List<ProductModel> products)
        {
            foreach (var product in products)
            {
                product.StyledDescription = ApplyStylesById(product.Id, product.Description);
            }
        }

        private string ApplyStylesById(int productId, string description)
        {
            if (productId == 1)
            {
                return $@"
            {description}<br /><br />
            <strong>Основні особливості:</strong><br />
            - Легкі черевики з жорсткою підошвою<br />
            - Міцна підошва амортизує і не ковзає<br />
            - Висота черевика забезпечує надійну фіксацію гомілкостопу<br />
            - Посилена зона носка<br />
            - Хороша підкладка в області щиколотки і язичка<br />
            - Дихаюча сітчаста підкладка<br />
            - Знімна устілка з EVA з антибактеріальним покриттям<br />
            - Система швидкого шнурування<br /><br />
            <strong>Матеріали:</strong><br />
            - Верх - Поліестер (ріпстоп), Поліуретан<br />
            - Підкладка - 100 % Поліестер<br />
            - Підошва - EVA, Гума<br />
            - Устілка – EVA";
            }
            if (productId == 2)
            {
                return $@"
            {description}<br /><br />
            <strong>Основні характеристики:</strong><br />"+
                "- Окуляри виготовлені з легкого та міцного полікарбонату товщиною 3,5 мм<br />" +
                    "- Поляризовані лінзи зводять до мінімуму вплив всіх відблисків та віддзеркалень<br />" +
                    "- Система проти запотівання запобігає запотіванню лінз, забезпечуючи чітку видимість<br />" +
                    "- Вентиляційні отвори, заповнені фільтруючою пилоутримуючою піною<br />" +
                    "- Регульований по довжині гумовий шов для стабільної фіксації на голові<br /><br />" +
                    "<strong>Комплект включає:</strong><br />" +
                    "- Три змінні лінзи (прозора, тонована, жовта)<br />" +
                    "- Серветка для чищення лінз<br />" +
                    "- Сумка для окулярів<br />" +
                    "- MOLLE / PALS - сумісний чохол для перенесення<br /><br />" +
                    "<strong>Технічні дані:</strong><br />" +
                    "- Колір оправи: Forest<br />" +
                    "- Матеріал лінз: 3,5 мм полікарбонат<br />" +
                    "- Захист: 100 % UVA / UVB<br />" +
                    "- Вага окулярів: 150 г<br />" +
                    "- Вага комплекту: 365 г<br />" +
                    "- Виробник: JB Tacticals, Польща";
            }
            if (productId == 3)
            {
                return $@"
            {description}<br /><br />
            <strong>Характеристики:</strong><br />"+
                "- Ствол довжиною 16 дюймів, виготовлений з високоміцної хромомолібденової сталі 4140<br />"+
                    "- Профіль SOCOM стовбура для поєднання легкості та гарної тепловіддачі<br />"+
                    "- ДТК типу A2 для ефективного зниження віддачі<br />"+
                    "- Ковані верхній і нижній ресивери з міцного анодованого алюмінію 7075-T6<br />"+
                    "- 15-дюймова цівка з легкого і міцного алюмінію з M-LOK системою кріплень<br /><br />"+
                    "<strong>Особливості цівки:</strong><br />"+
                    "- Оптимальна довжина для зручного розміщення аксесуарів і оптики<br />"+
                    "- Висока тепловіддача для запобігання перегріванню<br />"+
                    "- Система кріплень M-LOK для гнучкої настройки зброї<br /><br />"+
                    "<strong>Додаткова інформація:</strong><br />"+
                    "Карабін поставляється без додаткових аксесуарів та оптики, які можна легко встановити за допомогою M-LOK кріплень. Завдяки широкій функціональності " +
                    "та високій якості виготовлення, цей карабін є ідеальним вибором для стрільбища або тактичного використання.";
            }
            if (productId == 4)
            {
                return $@"
            {description}<br /><br />
            <strong>Особливості:</strong><br />"+
                       "- Посилена ручка для перенесення<br />"+
                       "- Сітчаста вентильована м'яка задня панель з застібкою на липучці<br />"+
                       "- Повністю регульовані контурні м'які плечові ремені з твердими пластиковими D-образними кільцями для кріплення<br />"+
                       "- Зовнішня кишеня-органайзер середнього розміру об'ємом 2 літри для предметів першої необхідності<br />"+
                       "- Чотири швидкознімні компресійні ремені для розширення або консолідації<br />"+
                       "- Стропи Molle по всій довжині для кріплення додаткових підсумків або спорядження<br />"+
                       "- Регульований поясний та нагрудний ремінь<br />"+
                       "- Фіксатори на липучках для запобігання надмірного ослаблення лямок<br /><br />"+
                       "<strong>Конструкція та матеріали:</strong><br />"+
                       "Поліестерова конструкція з підкладкою з ПВХ щільністю 600 ден.<br /><br />"+
                       "Цей рюкзак - ідеальний спутник для тих, хто цінує надійність та комфорт при перенесенні спорядження. Чудовий вибір для активного відпочинку, подорожей " +
                       "та повсякденного використання.";
            }
            if (productId == 5)
            {
                return $@"
            {description}<br /><br />
            <strong>Долоня:</strong><br />" +
                       "- Сумісна з сенсорним екраном на вказівному та великому пальцях<br />" +
                       "- Високодихаюча синтетична долоня<br />" +
                       "- Гібридні боковини пальців зі шкіри та тканини забезпечують чудову гнучкість у місцях з'єднання та посилення у місцях підвищеного стирання<br />" +
                       "- Силіконові накладки забезпечують міцне зчеплення зі зброєю та інструментами<br /><br />" +
                       "<strong>Деталі:</strong><br />" +
                       "- Лиття під тиском на тильній стороні для захисту від ударів<br />" +
                       "- Точний хват для безшовного, близького до шкіри тактильного відчуття<br />" +
                       "- Петля, що затягується, слугує кріпленням для фіксації рукавичок";
            }
            if (productId == 6)
            {
                return $@"
            {description}<br /><br />
            <strong>- Рівень захисту:</strong> НАТО NIJ Level IIIA 0106.01(1 клас ДСТУ 8835:2019)" +
                    "<br /><strong>- Матеріал:</strong> Кевлар" +
                    "<br /><strong>- Вага:</strong> ~1.4 кг" +
                    "<br /><strong>- Розмір:</strong> S, M, L, XL(Допомагаємо підібрати розмір)" +
                    "<br /><strong>- Сертифіковано, при купівлі видається протокол згідно ДСТУ</strong>" +
                    "<br /><strong>- Підвісна система:</strong> по типу BOA / Team Wendy регулюється коліщатком." +
                    "<br /><strong>- Активні навушники Walker's Razor Slim ( з чебурашкою в комплекті! )</strong> Призначені для носіння на бічних рейках на шоломі, " +
                    "щоб заглу́шувати шкідливі звуки з рівнем від 82 дБ, такі як постріли і вибухи, і посилювати слабкі навколишні звуки без втратисприйняття." +
                    "Вбудований в гарнітуру стереозвук забезпечує тривимірне сприйняття звуку, полегшуючи ідентифікацію джерел, таких як звук мови, шелест листя, " +
                    "постріли і наближення автомобілі.Пристрій має стереофонічні мікрофони, які дозволяють визначити напрямок звуку." +
                    "<br /><strong>-Кавер мультикам універсального розміру.</strong> Сумісний з усіма безвухими касками типу FAST та аналогами. " +
                    "Виготовлений із надміцної та зносостійкої ліцензованої " +
                    "тканини CORDURA 500D з NIR покриттям." +
                    "<br />Матеріали мають антиінфрачервоне покриття(NIR), що допомагає зменшити видимість у ближньому інфрачервоному діапазоні за допомогою приладу нічного бачення." +
                    "<br /><strong>- Універсальне кріплення Чебурашка</strong> Цей адаптер нового покоління дозволяє не тільки зручно налаштовувати навушники по висоті, але й підтримує обертання на 360 градусів навколо точки кріплення на шоломі для зручного використання, а також дозволяє індивідуально налаштовувати навушники завдяки кульовому кріпленню фіксатора чашки.Детальніше";
            }

            if (productId == 7)
            {
                return $@"
            {description}<br /><br />
                <strong>ХАРАКТЕРИСТИКИ</strong><br /><br />" +
                    "<strong>Трубка інтенсифікації зображення:</strong> Gen 2+ \"Білий фосфор Рівень 2\" Міжнародний<br />" +
                    "<strong>Косметичний рівень IIT:</strong> NW2i бюджет<br />" +
                    "<strong>Роздільна здатність:</strong> 45-57 ліній/мм<br />" +
                    "<strong>Видимі плями:</strong> дуже обмежено<br />" +
                    "<strong>Збільшення:</strong> 1x (опціонально 3x)<br />" +
                    "<strong>Система лінз:</strong> 19 мм; F/1.26<br />" +
                    "<strong>Поле зору:</strong> 51°<br />" +
                    "<strong>Діапазон фокусування:</strong> 0,25 м до нескінченності<br />" +
                    "<strong>Відстань до очей:</strong> 17 мм<br />" +
                    "<strong>Коректор діоптрій:</strong> -6 до +2 дпт<br />" +
                    "<strong>Міжзіркова відстань:</strong> 56 до 72 мм<br />" +
                    "<strong>Світлові індикатори:</strong> Слабкий акумулятор; ІЧ увімкнено; Екстремальні світлові умови<br />" +
                    "<strong>Ручне керування підсиленням:</strong> Так<br />" +
                    "<strong>Відсікання яскравого світла:</strong> Так<br />" +
                    "<strong>Автоматична система вимикання:</strong> Так<br />" +
                    "<strong>Інфрачервоний підсвічувач:</strong> Так<br />" +
                    "<strong>Тип батареї:</strong> Одна CR123A (3V) або AA (1,5 V)<br />" +
                    "<strong>Тривалість роботи від батареї:</strong> До 20 годин при 20°C (до 80 годин з опціональним акумуляторним блоком)<br />" +
                    "<strong>Діапазон температур при експлуатації:</strong> -40°C до +50°C (-40°F до +122°F)<br />" +
                    "<strong>Діапазон температур зберігання:</strong> -50°C до +50°C (-58°F до +122°F)<br />" +
                    "<strong>Вага:</strong> 615 г (1,35 фунта)<br />" +
                    "<strong>Загальні розміри:</strong> 112 × 118 × 74 мм (4,4 × 4,6 × 2,9 дюйма)";
            }

            if (productId == 8)
            {
                return $@"
            {description}<br /><br />
            <br /><strong>ХАРАКТЕРИСТИКИ</strong>" +
                       "<br /><strong>Категорія:</strong> Зброя та комплектуючі" +
                       "<br /><strong>Підкатегорія:</strong> Вогнепальна зброя" +
                       "<br /><strong>Підкатегорія:</strong> Нарізна зброя" +
                       "<br /><strong>Підкатегорія:</strong> З поздовжньо-ковзним затвором" +
                       "<br /><strong>Гарантія:</strong> 12 місяців" +
                       "<br /><strong>Виробник:</strong> Christensen Arms" +
                       "<br /><strong>Модель:</strong> Christensen Arms/Automatic Gen 2.3" +
                       "<br /><strong>Калібр:</strong> .308 Win" +
                       "<br /><strong>Приклад (ложа):</strong> Алюміній" +
                       "<br /><strong>Кількість патронів:</strong> 10+1" +
                       "<br /><strong>Конструкція магазина:</strong> Знімний коробчатий" +
                       "<br /><strong>Прицільні пристосування:</strong> Відсутні" +
                       "<br /><strong>Зброя нарізна:</strong> З поздовжньо-ковзним затвором" +
                       "<br /><strong>Модель зброї:</strong> Remington 700 Short Action";
            }
            return description;
        }
    }
}
